import os, glob
import codecs

docList = []
fname = []
length = 0
for filename in glob.glob('IndexList_Doc*.txt'):
    length += 1

for l in range(length):
    with codecs.open("IndexList_Doc" + str(l + 1) + ".txt", encoding='utf-8') as f:
        lines = f.read()
        docList.append(lines)

stopwords = ['እና', 'አመጥ', 'እንደሌለ', 'አለመኖር', 'ለማወቅ', 'በመሆን', 'ነገሰ', 'ማንኛው', 'የሚያስችል', 'ማለቱ', 'ዋና'
    , 'ዉስጥ', 'አስፈጻሚ', 'ባክዎ', 'ኢጋድ', 'አለመሆኑን', 'ይሄዳል', 'ወይንም', 'ተነግሯል', 'ተናገሩ', 'እንደነበሩ',
             'ግን', 'ርእይ', 'ተናግሮአል', 'በመሄድ', 'ታውሰዋል', 'እንዳስታወቀው', 'ወዲ', 'ተሰጥቷል', 'እየተደረገ', 'የሚደረግ',
             'ይችላሉ', 'የሚዳርግ', 'ሲሉም', 'እንደሚገባው', 'እንዳለባቸው', 'ገናማ', 'የሌለው', 'በሉ', 'እንዳለበት', 'የተነሳ',
             'የመሆን', 'ብሏል', 'ኖረ', 'ድረስ', 'ተያይዞ', 'የት', 'ተነጋግረው', 'የሚመጣው', 'ብለው', 'ተመልክቷል', 'መልክ',
             'ቢሆን', 'ሄደው', 'የሚደረጉ', 'ችሏል', 'ተችሏል', 'በተለያዩ', 'የሚሆኑት', 'የነበራቸው', 'ይሻላል', 'ነህ', 'ታይቷል',
             'ምንድነ', 'ይሄን', 'ይፋ', 'ያለውና', 'ያቀረቡ', 'አንጻር', 'ይችላል', 'እንደተጠበቀ', 'ያደረገ', 'ይጠቁማል', 'አይዘነጋም',
             'ወይም', 'እንደቻለ', 'የሚገኝ', 'አጠናቀዋል', 'የነበሩ', 'ትሆን', 'ቀርቦ', 'እነ', 'ይበልጥ', 'በተካሄደው', 'እንደሆነና',
             'አድርጎ', 'ካለ', 'ተገለፀ', 'ዋነኛ', 'ሳልቫ', 'እናገኛለን', 'የሚመጣ', 'የሆነው', 'ተናገር', 'ያለ', 'ብሎ', 'ይጀምራሉ',
             'እንደሚሆን', 'መኖራቸው', 'ሆነዋል', 'ያልሆኑ', 'ያከናውናል', 'በሰጡት', 'አለኝ', 'ላለ', 'ምላሽ', 'በተደረገ', 'ይልቃል',
             'የተነገረው', 'ያካትታል', 'እባኩ', 'ተናገረብ', 'ተብለው', 'የምትሆነው', 'ከፊል', 'በላይ', 'ደርሷል', 'ንዴት', 'ከነበረው',
             'ወስደው', 'በማለት', 'ልብ', 'አስረድቷል', 'ወስጥ', 'የነበረውን', 'የሚኖር', 'መናገራቸውን', ' ያስቸግራል', 'አስቆጥሯል',
             'ያስፈልገዋል', 'እንደሚካሄድ', 'እንዴ', 'ያሰቀምጣል', 'አይቻለልም', 'አልሁት', 'ይሁኑ', 'ያመለከታሉ', 'በኩል', 'ይገልፃል',
             'ስለሆነና', 'እየተባለ', 'አሏቸው', 'ባለው', 'የለውም', 'እንደሚሆን', 'ይመስላል', 'እንደመሆኑ', 'ያስታወሱት', 'ያለበት',
             'በምትሆነው', 'ሊሆኑ', 'እኔ', 'ይናገራ', 'ለሚገኘው', 'ሆን', 'ማድረጋቸው', 'አንዳንድ', 'አስፈላጊ', 'አይችልም', 'ይገመታል',
             'አለች', 'ሆና', 'ያጠናቀቀው', 'አክሏል', 'ተደንግጓል', 'ይችሉ', 'እንዲችሉ', 'ቃለ', 'ያህል', 'አስገነዘቡ', 'ወቅት', 'ስነ', 'ይታወሳል',
             'ይለዋል', 'ያብራራል', 'እንደሚገባም', 'ቀርቧል', 'ይረዳል', 'ተጋላጭ', 'እንደሚገኝ', 'ለመናገር', 'እናም', 'ለውጥ', 'ተናግሮኛል',
             'እንደማለት', 'ባደረገው', 'ወይዘሪት', 'እንመልከት', 'ሙሉ', 'ከሚገኙ', 'አልቻለም', 'አንተ', 'ይኸ', 'ይልዋል', 'እንድሆን', 'መጠቀሙ',
             'ያሳያሉ', 'ተናገርሁት', 'ይደርሳል', 'እንደማይችል', 'መሆኗን', 'የሚፈጠረው', 'በተከናወነው', 'በተመለከተም', 'እንዲቋረጥ', 'እንዳለ',
             'ስለሆነችም', 'እንዲወገድ', 'አጠቃላይ', 'እናንሳ', 'ከሆነም', 'ድጋሚ', 'አሳስበዋል', 'እየተካሄደ', 'የሚችለውን', 'ማድረግ', 'ባለ', 'አላት',
             'በዘለለ', 'ባኩሸ', 'አለበት', 'ጭምር', 'እየተሰጠ', 'እንደገለፁት', 'የሚያስችሉ', 'ይሆኑ', 'ቢሆኑ', 'የሚናገሩት', 'ካለው', 'እንዲቀጥል',
             'ይጠራል', 'ነውና', 'መሆናችን', 'የሚባል', 'ካልሆኑ', 'ምክንያት', 'ሲነገር', 'በሆነና', 'ይገባናል', 'የሚችል', 'የሆኑና', 'ስለሆኑም',
             'እንደሚችል', 'የሚከሰቱ', 'እንዳላቸው', 'ሊያደርግ', 'ማን', 'የሚፈጠር', 'ስለሚሆን', 'ተጠቁሟል', 'እንደሚሰራ', 'እንዳሉ', 'የሚያደርጉ',
             'ተመር', 'የሚሆን', 'ይገልጻል', 'ይታወቃል', 'አለው', 'ስለመሆኑም', 'ይጠቃሉ', 'አስቀምጧል', 'ጠዋል']
words = []
s = []
c = ''
for doc in docList:
    c = ' '.join(doc.split())
    s.append(c)


def remove_DocumentStopword():
    d = []
    for doc in s:
        for sw in stopwords:
            if sw in doc:
                doc = doc.replace(sw, '')
        d.append(doc)

    i = 1
    for dt in d:
        with codecs.open('IndexList_Doc' + str(i) + '.txt', 'a', encoding='utf-8') as f:
            f.truncate(0)
            f.close()
        i += 1

    i = 1
    for dt in d:
        with codecs.open('IndexList_Doc' + str(i) + '.txt', 'a', encoding='utf-8') as f:
            for word in dt.split():
                f.write(word)
                f.write('\n')
            f.close()
        i += 1

    with codecs.open('results.txt', 'a', encoding='utf-8') as f:
        for word in s:
            f.write(word)
            f.write('\n')
        f.close()


def readQuery():
    with codecs.open('IndexList_Query.txt', encoding='utf-8') as f:
        lines = f.read()
        f.close()
    return lines


def remove_queryStopword():
    query = readQuery()
    q = ' '.join(query.split())
    print(q)
    for sw in stopwords:
        if sw in q:
            q = q.replace(sw, '')
    with codecs.open('IndexList_Query.txt', 'a', encoding='utf-8') as f:
        f.truncate(0)
        for word in q.split():
            f.write(word)
            f.write('\n')
        f.close()
    for word in q.split():
        print(word)

remove_DocumentStopword()
